In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
suv_dataset = pd.read_csv("suv_data.csv")

In [4]:
suv_dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
suv_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [6]:
suv_dataset.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [7]:
suv_dataset.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [8]:
suv_dataset.drop("User ID",axis=1,inplace=True)

In [9]:
suv_dataset.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [10]:
gender = pd.get_dummies(suv_dataset["Gender"],drop_first=True)
gender

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [11]:
suv_dataset = pd.concat([suv_dataset,gender],axis=1)

In [12]:
suv_dataset.head()

   Gender  Age  EstimatedSalary  Purchased  Male
0    Male   19            19000          0     1
1    Male   35            20000          0     1
2  Female   26            43000          0     0
3  Female   27            57000          0     0
4    Male   19            76000          0     1

In [13]:
suv_dataset.drop("Gender",axis=1,inplace=True)

In [14]:
suv_dataset.head()

   Age  EstimatedSalary  Purchased  Male
0   19            19000          0     1
1   35            20000          0     1
2   26            43000          0     0
3   27            57000          0     0
4   19            76000          0     1

In [15]:
column_names = ["Age","Male","EstimatedSalary","Purchased"]

In [16]:
suv_dataset= suv_dataset.reindex(columns=column_names)

In [17]:
suv_dataset.head()

   Age  Male  EstimatedSalary  Purchased
0   19     1            19000          0
1   35     1            20000          0
2   26     0            43000          0
3   27     0            57000          0
4   19     1            76000          0

In [25]:
X = suv_dataset.iloc[:,:3]

In [26]:
X.head()

   Age  Male  EstimatedSalary
0   19     1            19000
1   35     1            20000
2   26     0            43000
3   27     0            57000
4   19     1            76000

In [27]:
y = suv_dataset["Purchased"]

In [28]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [29]:
y.shape

(400,)

In [30]:
X

     Age  Male  EstimatedSalary
0     19     1            19000
1     35     1            20000
2     26     0            43000
3     27     0            57000
4     19     1            76000
..   ...   ...              ...
395   46     0            41000
396   51     1            23000
397   50     0            20000
398   36     1            33000
399   49     0            36000

[400 rows x 3 columns]

In [31]:
from sklearn.model_selection import train_test_split

In [32]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.25,random_state=0)

# SCALING DATA

In [33]:
from sklearn.preprocessing import StandardScaler

In [34]:
sc= StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.fit_transform(X_test)

In [35]:
from sklearn.linear_model import LogisticRegression

In [36]:
classifier= LogisticRegression(random_state=0)

In [37]:
classifier.fit(X_train,y_train)

LogisticRegression(random_state=0)

In [38]:
y_pred = classifier.predict(X_test)

In [39]:
from sklearn.metrics import accuracy_score

In [40]:
accuracy_score(y_test,y_pred)

0.91